In [3]:
import pandas as pd 
import numpy as np

df = pd.read_csv('../data/final_df.csv')
df

,ID,NAME_EDUCATION_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_FAMILY_STATUS,DAYS_EMPLOYED,credit_decision,age,workclass,occupation,capital,hours-per-week
0,5008804,Higher education,M,Y,Y,427500.0,Working,Civil marriage,-4542,1,36.332433,Private,Adm-clerical,509.390789,39.454320
1,5008805,Higher education,M,Y,Y,427500.0,Working,Civil marriage,-4542,1,36.332433,Private,Adm-clerical,509.390789,39.454320
2,5008806,Secondary / secondary special,M,Y,Y,112500.0,Working,Married,-1134,-1,38.135474,Private,Craft-repair,440.541682,39.552563
3,5008808,Secondary / secondary special,F,N,Y,270000.0,Commercial associate,Single / not married,-3051,-1,38.135474,Private,Craft-repair,440.541682,39.552563
4,5008809,Secondary / secondary special,F,N,Y,270000.0,Commercial associate,Single / not married,-3051,0,38.135474,Private,Craft-repair,440.541682,39.552563
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
36452,5149828,Secondary / secondary special,M,Y,Y,315000.0,Working,Married,-2420,-1,38.135474,Private,Craft-repair,440.541682,39.552563
36453,5149834,Higher education,F,N,Y,157500.0,Commercial associate,Married,-1325,-1,36.332433,Private,Adm-clerical,509.390789,39.454320
36454,5149838,Higher education,F,N,Y,157500.0,Pensioner,Married,-1325,-1,36.332433,Private,Adm-clerical,509.390789,39.454320
36455,5150049,Secondary / secondary special,F,N,Y,283500.0,Working,Married,-655,-1,38.135474,Private,Craft-repair,440.541682,39.552563
36456,5150337,Secondary / secondary special,M,N,Y,112500.0,Working,Single / not married,-1193,-1,38.135474,Private,Craft-repair,440.541682,39.552563

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36457 entries, 0 to 36456
Data columns (total 15 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   36457 non-null  int64
 1   NAME_EDUCATION_TYPE  36457 non-null  object
 2   CODE_GENDER          36457 non-null  object
 3   FLAG_OWN_CAR         36457 non-null  object
 4   FLAG_OWN_REALTY      36457 non-null  object
 5   AMT_INCOME_TOTAL     36457 non-null  float64
 6   NAME_INCOME_TYPE     36457 non-null  object
 7   NAME_FAMILY_STATUS   36457 non-null  object
 8   DAYS_EMPLOYED        36457 non-null  int64
 9   credit_decision      36457 non-null  int64
 10  age                  36457 non-null  float64
 11  workclass            36457 non-null  object
 12  occupation           36457 non-null  object
 13  capital              36457 non-null  float64
 14  hours-per-week       36457 non-null  float64
dtypes: float64(4), int64(3), object(8)
memory usage: 4.2+ MB

In [8]:
for col in df.columns:
    if df[col].dtype == 'object':
        print(col,': ',df[col].unique())

NAME_EDUCATION_TYPE :  ['Higher education' 'Secondary / secondary special' 'Lower secondary'
 'Academic degree']
CODE_GENDER :  ['M' 'F']
FLAG_OWN_CAR :  ['Y' 'N']
FLAG_OWN_REALTY :  ['Y' 'N']
NAME_INCOME_TYPE :  ['Working' 'Commercial associate' 'Pensioner' 'State servant' 'Student']
NAME_FAMILY_STATUS :  ['Civil marriage' 'Married' 'Single / not married' 'Separated' 'Widow']
workclass :  ['Private']
occupation :  ['Adm-clerical' 'Craft-repair' 'Other-service' 'Prof-specialty']

In [9]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
y = df['credit_decision']
df.drop(['credit_decision','ID'],axis=1,inplace=True)
for col in df.columns:
    if df[col].dtype != 'object':
        df[col] = scaler.fit_transform(df[[col]])
    else:
        df[col] = pd.get_dummies(df[col],drop_first=True)

,NAME_EDUCATION_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_FAMILY_STATUS,DAYS_EMPLOYED,age,workclass,occupation,capital,hours-per-week
0,Higher education,M,Y,Y,427500.0,Working,Civil marriage,-4542,36.332433,Private,Adm-clerical,509.390789,39.454320
1,Higher education,M,Y,Y,427500.0,Working,Civil marriage,-4542,36.332433,Private,Adm-clerical,509.390789,39.454320
2,Secondary / secondary special,M,Y,Y,112500.0,Working,Married,-1134,38.135474,Private,Craft-repair,440.541682,39.552563
3,Secondary / secondary special,F,N,Y,270000.0,Commercial associate,Single / not married,-3051,38.135474,Private,Craft-repair,440.541682,39.552563
4,Secondary / secondary special,F,N,Y,270000.0,Commercial associate,Single / not married,-3051,38.135474,Private,Craft-repair,440.541682,39.552563
...,...,...,...,...,...,...,...,...,...,...,...,...,...
36452,Secondary / secondary special,M,Y,Y,315000.0,Working,Married,-2420,38.135474,Private,Craft-repair,440.541682,39.552563
36453,Higher education,F,N,Y,157500.0,Commercial associate,Married,-1325,36.332433,Private,Adm-clerical,509.390789,39.454320
36454,Higher education,F,N,Y,157500.0,Pensioner,Married,-1325,36.332433,Private,Adm-clerical,509.390789,39.454320
36455,Secondary / secondary special,F,N,Y,283500.0,Working,Married,-655,38.135474,Private,Craft-repair,440.541682,39.552563
36456,Secondary / secondary special,M,N,Y,112500.0,Working,Single / not married,-1193,38.135474,Private,Craft-repair,440.541682,39.552563

In [11]:
df_1 = pd.get_dummies(df['CODE_GENDER'],drop_first=True)
df_1

           M
0       True
1       True
2       True
3      False
4      False
...      ...
36452   True
36453  False
36454  False
36455  False
36456   True

[36457 rows x 1 columns]